<template>
  <TabView :pt="{
        panelContainer: {
          class: 'bg-transparent'
        },
        navContainer: {
          class: 'border-none'
        },
         nav: {
          class: 'bg-transparent border-[0] nav-panel'
          },
          inkbar: {
           class: 'h-[4px] bg-[var(--color-primary-purple)]'
          }
      }">
    <TabPanel :header="tabs.description.header">
      <p class="m-0">
        <p class="mb-4">
          <strong>Nutrex Anabol</strong>  допомагає збільшити синтез протеїну в скелетних м'язах, при одночасному
          зменшенні впливу
          протеолітичних процесів. Надаючи кращі адаптогенні ефекти в тренувальному процесі і харчуванні, Anabol 5
          допомагає дорегулювати власний цикл білка в організмі.
          Anabol від Nutrex представляє собою універсальний продукт, який може бути використаний в якості доповнення
          при прагненні набрати максимальну вагу і збільшити розміри, а також в процесі сушки, щоб зберегти і
          наростити якісні м'язи. <strong>Що робить Anabol 5 таким анаболічним?</strong>
        </p>
        <p class="mb-4"><strong>Ді-циклопентанон</strong> . Є синтетичним аналогом рослинного стеролу з високою
          анаболічною дією, який виявляє себе
          при збільшенні затримки азоту в м'язах. Це означає, що в Anabol 5 ді-циклопентанон сприяє збільшенню
          вмісту
          білка в м'язах, а це в свою чергу спричиняє збільшення м'язової маси.</p>
        <p class="mb-4"><strong>6-кето-диосгенин ацетат, пропіонат, ципіонат, деканоат-ефір</strong>
          6-кето-диосгенин ацетат, пропіонат, ципіонат, деканоат-ефір. 6-кето-діосгенін є сапоніном природного
          походження, який виявляє анаболічну активність, не проявляючи жодних андрогенних властивостей. Його
          анаболізм полягає в збільшенні затримки азоту. Крім цього, 6-кето-діосгенін в наукових дослідженнях
          показав
          свою ефективність в наборі м'язової маси. 6-кето-діосгенін в Anabol 5 пов'язаний з 4 різними ефірами, що
          гарантують швидку, середню і тривалу дію.
          Гекогенін ацетат. Гекогенін – це також естеризована версія сапоніна природного походження. В результаті
          застосування він показав свою ефективність в зниженні м'язового запалення. Крім того, він допомагає
          поліпшити відновлювальні процеси після тренування і сприяє збільшенню м'язової маси і сили.</p>
        <p><strong>Рекомендації щодо застосування:</strong> Приймайте 1 рідку капсулу вранці та 1 рідку капсулу
          ввечері. Для досягнення
          найкращих результатів використовуйте щодня і циклічно. Рекомендована тривалість циклу – 12 тижнів, 4 тижні
          перерва.</p>
      </p>
    </TabPanel>
    <TabPanel :header="tabs.characteristics.header">
      <div class="characteristics-list max-w-[1030px] w-full">
        <div
            v-for="characteristic in tabs.characteristics.list"
            :key="characteristic.key"
            class="flex items-center gap-4 py-2"
        >
          <p class="characteristics-list__title whitespace-nowrap">
            {{ characteristic.key }}
          </p>
          <div
              class="flex-grow h-px bg-[#5856D6]"
              style="margin-top: 1em;"
          ></div>
          <p class="characteristics-list__value whitespace-nowrap">
            {{ characteristic.value }}
          </p>
        </div>
      </div>
    </TabPanel>
    <TabPanel :header="tabs.delivery.header">
      <div class="delivery-and-payment">
        <div class="mb-4">
          <strong class="fw-600 leading-[33px]">Оплата</strong>
        </div>
        <p class="mb-4">Оплата здійснюється через <strong>Telegram</strong>. Після оформлення замовлення наш
          менеджер зв’яжеться з вами у Telegram для підтвердження замовлення та надасть реквізити для оплати.</p>
        <div class="mb-4">
          <strong>Доступні методи оплати:</strong>
          <ul class="list-disc pl-6">
            <li>Банківський переказ (Monobank, ПриватБанк та інші)</li>
            <li>Переказ на картку</li>
            <li>Криптовалюта (за запитом)</li>
          </ul>
        </div>

        <div class="mb-4">
          <strong>Доставка</strong>
          <div>
            <p>По Україні:</p>
            <ul class="list-disc pl-6">
              <li>Нова Пошта – 1-3 дні, згідно з тарифами перевізника</li>
              <li>Укрпошта – 3-7 днів</li>
            </ul>
          </div>
          <div>
            <p>Міжнародна доставка:</p>
            <ul class="list-disc pl-6">
              <li>Доставка в інші країни здійснюється через міжнародні поштові сервіси</li>
              <li>Терміни та вартість доставки залежать від країни одержувача та вибраного перевізника</li>
              <li>Після відправки ви отримаєте номер для відстеження посилки</li>
            </ul>
          </div>

        </div>

        <div>
          <div>
            <p>📌 Важливо!</p>
            <ul class="list-disc pl-6">
              <li>Відправка здійснюється тільки після повної передоплати</li>
              <li>Точну вартість міжнародної доставки уточнюйте у менеджера в Telegram</li>
            </ul>
          </div>
        </div>
      </div>
    </TabPanel>
    <TabPanel :header="tabs.reviews.header">
      <div class="reviews-content  murecho-font flex justify-between">

        <div class="review-list pt-[26px] justify-self-start">
          <div class="review-card mb-[23px] last:mb-0 max-w-[518px]" v-for="review in reviews">
            <div class="flex justify-between items-center">
              <p class="review-card__name fw-600">{{ review.name }}</p>
              <div class="review-card__date text-[14px]">{{ review.date }}</div>
              <div class="review-card__stars">
                <Rating v-model="review.stars" readonly>
                  <template #onicon>
                    <img src="@/assets/icons/star-filled.svg" class="mr-1"/>
                  </template>
                  <template #officon>
                    <img src="@/assets/icons/star-empty.svg" class="mr-1"/>
                  </template>
                </Rating>
              </div>
              <div class="review-card__confirmed text-[#ADADAD] fw-400">
                <p v-if="review.purchaseConfirmed">{{ t('purchase_confirmed') }}</p>
                <p v-else>{{ t('purchase_not_confirmed') }}</p>
              </div>
            </div>

            <p class="review-card__comment">{{ review.comment }}</p>
          </div>
        </div>

        <div class="review-form max-w-[642px] w-full">
          <div class="mb-4">
            <h2 class="form-title fw-500">{{ t('new_review') }}</h2>
          </div>
          <div class="mb-4 rounded-[8px] max-w-[354px]">
            <InputText class="w-full h-[42px] py-[10px] rounded-[8px]" :placeholder="t('your_name')"/>
          </div>
          <div class="mb-[10px] rounded-[8px]">
                <Textarea style="resize: none" class="w-full rounded-[8px]" :placeholder="t('share_your_impressions')"
                          rows="5" cols="30"/>
          </div>

          <div class="rate-product mb-[27px] flex items-center">
            <p class="mr-[10px] text-[14px]">{{ t('rate_product') }}</p>
            <Rating>
              <template #onicon>
                <img src="@/assets/icons/star-filled.svg" class="mr-1"/>
              </template>
              <template #officon>
                <img src="@/assets/icons/star-empty.svg" class="mr-1"/>
              </template>
            </Rating>
          </div>

          <div
              class="rounded-[8px] max-w-[386px]">
            <Button :pt="{
                  root: {
                    class: 'send-review__btn btn-hover-default'
                  }
                }"><p class="text-[14px]">{{ t('submit_review') }}</p></Button>
          </div>

        </div>
      </div>
    </TabPanel>
  </TabView>
</template>

<script setup>

const { t } = useI18n()

const reviews = [
  {
    name: "Огірковий Огірок",
    comment: "Чудовий товар! Взяв всю партію!",
    date: "07.07.2024",
    stars: 2,
    purchaseConfirmed: true
  },
  {
    name: "Огірковий Огірок",
    comment: "Протестував Nutrex Research Anabol Hardcore для набору м’язової маси та збільшення сили. Вже через тиждень помітив поліпшення: м’язи стали щільнішими, зросли робочі ваги, а відновлення після тренувань значно прискорилося.",
    date: "07.07.2024",
    stars: 5,
    purchaseConfirmed: true
  },
  {
    name: "Огірковий Огірок",
    comment: "Чудовий товар! Взяв всю партію!",
    date: "07.07.2024",
    stars: 3,
    purchaseConfirmed: true
  },
]

const tabs = {
  description: {
    header:  computed(() => t('tabs_description')),
  },
  delivery: {
    header: computed(() => t('tabs_delivery'))
  },
  reviews: {
    header: computed(() => t('tabs_reviews')),
  },
  characteristics: {
    header: computed(() => t('tabs_characteristics')),
    list: [
      {key: "Виробник", value: "Nutrex Research"},
      {key: "Тип продукту", value: "Анаболічна добавка"},
      {key: "Форма випуску", value: "Капсули"},
      {key: "Кількість в упаковці", value: "60 капсул"},
      {key: "Основні інгредієнти", value: "Анаболічний комплекс на основі рослинних стероїдів"},
      {key: "Призначення", value: "Підвищення сили, витривалості та набору м’язової маси"},
      {key: "Рекомендована доза", value: "2 капсули на день (1 вранці, 1 ввечері)"},
      {key: "Час прийому", value: "Після їжі"},
      {key: "Особливості", value: "Без гормонів, не впливає на рівень тестостерону"},
      {key: "Кому підходить", value: "Спортсменам та бодібілдерам"},
      {key: "Протипоказання", value: "Індивідуальна непереносимість, вагітність, період лактації"},
      {key: "Термін придатності", value: "Вказаний на упаковці"},
    ]
  }
}
</script>

<style scoped>
.send-review__btn {
  background: var(--color-primary-dark);
  width: 100%;
}
</style>