import {defineStore} from 'pinia'
import {ref} from 'vue'

export const useStaticPages = defineStore('static-pages', () => {
    const staticPages = ref([
        {
            slug: 'shipping-and-payment',
            accordion: true,
            content: [
                {
                    title: 'Часті запитання (FAQ)', blocks: [
                        {
                            blockTitle: 'Чи легально купувати стероїди в Україні?,',
                            blockContent: 'Придбання стероїдів для особистого користування не заборонене, однак відповідальність за їх використання лежить на самому покупцеві. Ми рекомендуємо перед застосуванням проконсультуватися з лікарем чи спортивним лікарем.'
                        },
                        {
                            blockTitle: 'Як переконатися, що продукція оригінальна?,',
                            blockContent: 'Ми співпрацюємо виключно з офіційними постачальниками та гарантуємо 100% автентичність продукції. До кожного товару додається захисна голограма або код для перевірки на сайті виробника.'
                        },
                        {
                            blockTitle: 'Чи потрібен рецепт для покупки?,',
                            blockContent: 'Ні, для придбання стероїдів на нашому сайті рецепт не потрібен. Проте ми наполегливо рекомендуємо проходити медичний огляд перед початком курсу.'
                        },
                        {
                            blockTitle: 'Як правильно підібрати курс стероїдів?,',
                            blockContent: 'Наші консультанти допоможуть підібрати індивідуальний курс залежно від ваших цілей: набір м’язової маси, рельєф, сила чи витривалість. Звертайтесь — порадимо оптимальні варіанти.'
                        },
                        {
                            blockTitle: 'Чи можна замовити анонімно?,',
                            blockContent: 'Так, ми повністю гарантуємо конфіденційність. Ваші дані захищені, а замовлення доставляються в непрозорій упаковці без будь-яких позначок.'
                        },
                         {
                            blockTitle: 'Які способи доставки та оплати доступні?,',
                            blockContent: 'Ми доставляємо по всій Україні популярними службами доставки. Оплата можлива післяплатою або передоплатою на банківську картку.'
                        },
                    ]
                },
            ]
        },
        {
            slug: 'about-us',
            accordion: false,
            content: [
                {
                    title: null,
                    content: 'Ми — команда професіоналів, яка спеціалізується на продажу високоякісних стероїдів для спортсменів та людей, що прагнуть досягти максимальної ефективності у своїх тренуваннях. Наша місія — допомогти кожному клієнту покращити фізичні показники, досягти бажаних результатів та підтримувати здоровий і відповідальний підхід до використання спортивної фармакології.'
                },
                {
                    title: null,
                    content: 'Ми співпрацюємо лише з перевіреними виробниками та гарантуємо автентичність усієї продукції. Весь наш асортимент проходить суворий контроль якості, а консультації надають фахівці з багаторічним досвідом у галузі спортивного харчування та фармакології.'
                },
                {
                    title: 'Чому обирають нас:',
                    content: 'Оригінальна продукція від надійних брендів.'
                },
                {
                    title: 'Чому обирають нас:',
                    content: 'Оригінальна продукція від надійних брендів.'
                },

            ]
        },
    ])

    function setPages(pages) {
        console.log(pages)
    }

    const getCurrentPage = (slug) => {
        return staticPages.value.find(page => page.slug === slug)
    }


    return {
        setPages,
        getCurrentPage
    }
})
