import {defineStore} from 'pinia'
import {ref} from 'vue'

import aboutMainPhoto from "~/assets/images/about-main-photo.png"
import aboutSubPhoto from "~/assets/images/about-sub-photo.png"


export const useStaticPages = defineStore('static-pages', () => {
    const staticPages = ref([
        {
            slug: 'frequently-questions',
            accordion: true,
            content: [
                {
                    title: 'Питання та відповіді', blocks: [
                        {
                            title: 'Чи легально купувати стероїди в Україні?,',
                            content: 'Придбання стероїдів для особистого користування не заборонене, однак відповідальність за їх використання лежить на самому покупцеві. Ми рекомендуємо перед застосуванням проконсультуватися з лікарем чи спортивним лікарем.'
                        },
                        {
                            title: 'Як переконатися, що продукція оригінальна?,',
                            content: 'Ми співпрацюємо виключно з офіційними постачальниками та гарантуємо 100% автентичність продукції. До кожного товару додається захисна голограма або код для перевірки на сайті виробника.'
                        },
                        {
                            title: 'Чи потрібен рецепт для покупки?,',
                            content: 'Ні, для придбання стероїдів на нашому сайті рецепт не потрібен. Проте ми наполегливо рекомендуємо проходити медичний огляд перед початком курсу.'
                        },
                        {
                            title: 'Як правильно підібрати курс стероїдів?,',
                            content: 'Наші консультанти допоможуть підібрати індивідуальний курс залежно від ваших цілей: набір м’язової маси, рельєф, сила чи витривалість. Звертайтесь — порадимо оптимальні варіанти.'
                        },
                        {
                            title: 'Чи можна замовити анонімно?,',
                            content: 'Так, ми повністю гарантуємо конфіденційність. Ваші дані захищені, а замовлення доставляються в непрозорій упаковці без будь-яких позначок.'
                        },
                         {
                             title: 'Які способи доставки та оплати доступні?,',
                             content: 'Ми доставляємо по всій Україні популярними службами доставки. Оплата можлива післяплатою або передоплатою на банківську картку.'
                        },
                    ]
                },
            ]
        },
        {
            slug: 'about-us',
            accordion: false,
            content: [
                {
                    split: false,
                    image: aboutMainPhoto,
                    imagePosition: "left",
                    content: '<h1>Про SP BALKAN</h1><h2><br></h2><p><strong>Ми — команда професіоналів, яка спеціалізується на продажу високоякісних стероїдів для спортсменів та людей, що прагнуть досягти максимальної ефективності у своїх тренуваннях. Наша місія — допомогти кожному клієнту покращити фізичні показники, досягти бажаних результатів та підтримувати здоровий і відповідальний підхід до використання спортивної фармакології.</strong></p><p><br></p><undefined><strong>Ми співпрацюємо лише з перевіреними виробниками та гарантуємо автентичність усієї продукції. Весь наш асортимент проходить суворий контроль якості, а консультації надають фахівці з багаторічним досвідом у галузі спортивного харчування та фармакології. </strong></undefined>'
                },
                {
                    split: true,
                    image: aboutSubPhoto,
                    imagePosition: "right",
                    content: "<h1>Чому обирають нас?</h1><p><br></p><ol><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Оригінальна продукція від надійних брендів.</strong></li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Індивідуальний підбір курсів відповідно до ваших цілей.</strong></li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Швидка доставка по Україні.</strong></li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Конфіденційність та безпека кожного замовлення</strong></li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Професійна консультація на всіх етапах.</strong></li></ol><p><br></p><h2><strong>Ми цінуємо довіру наших клієнтів та працюємо для вашого успіху!</strong></h2>",
                },
            ]
        },
        {
            slug: 'shipping-and-payment',
            accordion: false,
            content: [
                {
                    title: 'Оплата та доставка',
                    split: false,
                    content: `
          <h2>Оплата</h2>
          <p><br></p>
          <p>Оплата здійснюється через <strong>Telegram</strong>. Після оформлення замовлення наш менеджер зв’яжеться з вами у Telegram для підтвердження замовлення та надасть реквізити для оплати.</p>
          <p>Доступні методи оплати:</p>
          <p>Банківський переказ (Monobank, ПриватБанк та інші)</p>
          <p>Переказ на картку</p>
          <p>Криптовалюта (за запитом)</p>
          <p><br></p>
          <p><strong>Доставка</strong></p>
          <p>По Україні:</p>
          <ol>
            <li>Нова Пошта – 1-3 дні, згідно з тарифами перевізника</li>
            <li>Укрпошта – 3-7 днів</li>
            <li>Міжнародна доставка:</li>
            <li>Доставка в інші країни здійснюється через міжнародні поштові сервіси</li>
            <li>Терміни та вартість доставки залежать від країни одержувача та вибраного перевізника</li>
            <li>Після відправки ви отримаєте номер для відстеження посилки</li>
          </ol>
          <p><br></p>
          <p>📌 <strong>Важливо</strong>!</p>
          <ol>
            <li>Відправка здійснюється тільки після повної передоплати</li>
            <li>Точну вартість міжнародної доставки уточнюйте у менеджера в Telegram</li>
          </ol>
        `
                }
            ]
        }
    ])

    function setPages(pages) {
        console.log(pages)
    }

    const getCurrentPage = (slug) => {
        return staticPages.value.find(page => page.slug === slug)
    }


    return {
        setPages,
        getCurrentPage
    }
})
