import {defineStore} from 'pinia'
import {ref} from 'vue'

export const useStaticPages = defineStore('static-pages', () => {
    const staticPages = ref([
        {
            slug: 'shipping-and-payment',
            accordion: true,
            content: [
                {
                    title: 'Вибір товару', blocks: [
                        {
                            blockTitle: 'Ви можете допомогти мені з вибором правильного товару?',
                            blockContent: 'Ми завжди раді допомогти вам у виборі необхідних добавок, продуктів та аксесуарів, які представлені на нашому сайті. Вам буде достатньо звернутися до нашої служби підтримки за телефоном 0800216969,  Telegram: +380 96 099 02 99 або написати нам на пошту info@gymbeam.ua. Ми завжди раді відповісти на будь-які ваші запитання.'
                        },
                        {
                            blockTitle: 'Ви можете допомогти мені з вибором правильного товару?',
                            blockContent: 'Ми завжди раді допомогти вам у виборі необхідних добавок, продуктів та аксесуарів, які представлені на нашому сайті. Вам буде достатньо звернутися до нашої служби підтримки за телефоном 0800216969,  Telegram: +380 96 099 02 99 або написати нам на пошту info@gymbeam.ua. Ми завжди раді відповісти на будь-які ваші запитання.'
                        }
                    ]
                },
                {
                    title: 'Реєстрація та процес оформлення замовлення', blocks: [
                        {
                            blockTitle: 'Ви можете допомогти мені з вибором правильного товару?',
                            blockContent: 'Ми завжди раді допомогти вам у виборі необхідних добавок, продуктів та аксесуарів, які представлені на нашому сайті. Вам буде достатньо звернутися до нашої служби підтримки за телефоном 0800216969,  Telegram: +380 96 099 02 99 або написати нам на пошту info@gymbeam.ua. Ми завжди раді відповісти на будь-які ваші запитання.'
                        },
                    ]
                },
            ]
        },
        {
            slug: 'about-us',
            accordion: false,
            content: [
                {
                    title: null,
                    content: 'Ми — команда професіоналів, яка спеціалізується на продажу високоякісних стероїдів для спортсменів та людей, що прагнуть досягти максимальної ефективності у своїх тренуваннях. Наша місія — допомогти кожному клієнту покращити фізичні показники, досягти бажаних результатів та підтримувати здоровий і відповідальний підхід до використання спортивної фармакології.'
                },
                {
                    title: null,
                    content: 'Ми співпрацюємо лише з перевіреними виробниками та гарантуємо автентичність усієї продукції. Весь наш асортимент проходить суворий контроль якості, а консультації надають фахівці з багаторічним досвідом у галузі спортивного харчування та фармакології.'
                },
                {
                    title: 'Чому обирають нас:',
                    content: 'Оригінальна продукція від надійних брендів.'
                },
                {
                    title: 'Чому обирають нас:',
                    content: 'Оригінальна продукція від надійних брендів.'
                },

            ]
        },
    ])

    function setPages(pages) {
        console.log(pages)
    }

    const getCurrentPage = (slug) => {
        return staticPages.value.find(page => page.slug === slug)
    }


    return {
        setPages,
        getCurrentPage
    }
})
