import {defineStore} from 'pinia'
import {ref} from 'vue'

export const useStaticPages = defineStore('static-pages', () => {
    const staticPages = ref([
        {
            slug: 'frequently-questions',
            accordion: true,
            content: [
                {
                    title: 'Часті запитання (FAQ)', blocks: [
                        {
                            title: 'Чи легально купувати стероїди в Україні?,',
                            content: 'Придбання стероїдів для особистого користування не заборонене, однак відповідальність за їх використання лежить на самому покупцеві. Ми рекомендуємо перед застосуванням проконсультуватися з лікарем чи спортивним лікарем.'
                        },
                        {
                            title: 'Як переконатися, що продукція оригінальна?,',
                            content: 'Ми співпрацюємо виключно з офіційними постачальниками та гарантуємо 100% автентичність продукції. До кожного товару додається захисна голограма або код для перевірки на сайті виробника.'
                        },
                        {
                            title: 'Чи потрібен рецепт для покупки?,',
                            content: 'Ні, для придбання стероїдів на нашому сайті рецепт не потрібен. Проте ми наполегливо рекомендуємо проходити медичний огляд перед початком курсу.'
                        },
                        {
                            title: 'Як правильно підібрати курс стероїдів?,',
                            content: 'Наші консультанти допоможуть підібрати індивідуальний курс залежно від ваших цілей: набір м’язової маси, рельєф, сила чи витривалість. Звертайтесь — порадимо оптимальні варіанти.'
                        },
                        {
                            title: 'Чи можна замовити анонімно?,',
                            content: 'Так, ми повністю гарантуємо конфіденційність. Ваші дані захищені, а замовлення доставляються в непрозорій упаковці без будь-яких позначок.'
                        },
                         {
                             title: 'Які способи доставки та оплати доступні?,',
                             content: 'Ми доставляємо по всій Україні популярними службами доставки. Оплата можлива післяплатою або передоплатою на банківську картку.'
                        },
                    ]
                },
            ]
        },
        {
            slug: 'about-us',
            accordion: false,
            content: [
                {
                    title: "Про SP BALKAN",
                    split: false,
                    content: '<p>Ми — команда професіоналів, яка спеціалізується на продажу високоякісних стероїдів для спортсменів та людей, що прагнуть досягти максимальної ефективності у своїх тренуваннях. Наша місія — допомогти кожному клієнту покращити фізичні показники, досягти бажаних результатів та підтримувати здоровий і відповідальний підхід до використання спортивної фармакології.</p><p><br></p><p>Ми співпрацюємо лише з перевіреними виробниками та гарантуємо автентичність усієї продукції. Весь наш асортимент проходить суворий контроль якості, а консультації надають фахівці з багаторічним досвідом у галузі спортивного харчування та фармакології. </p>\n',
                },
                {
                    title: "Чому обирають нас?",
                    split: true,
                    content: "<p>Оригінальна продукція від надійних брендів.</p><p><br></p><p>Конфіденційність та безпека кожного замовлення</p><p><br></p><p>Індивідуальний підбір курсів відповідно до ваших цілей.</p><p><br></p><p>Професійна консультація на всіх етапах.</p><p><br></p><p>Швидка доставка по Україні.</p><p>Ми цінуємо довіру наших клієнтів.</p>\n",
                },
                {
                    title: "Ми цінуємо довіру наших клієнтів та працюємо для вашого успіху!",
                    split: false,
                    content: "",
                },

            ]
        },
    ])

    function setPages(pages) {
        console.log(pages)
    }

    const getCurrentPage = (slug) => {
        return staticPages.value.find(page => page.slug === slug)
    }


    return {
        setPages,
        getCurrentPage
    }
})
